import { BookCopy, BookOpenText, BrainCircuit, Layers, ScrollText, UserRoundPlus } from "lucide-react";


const features = [
    {
        icon: UserRoundPlus,
        title: "ระบบรับสมัครนักเรียน",
        desc: "หากท่านต้องการเข้าเรียน ท่านสามารถดูรายละเอียดของระบบรับสมัครนักเรียนได้ที่นี่",
        href: "/admission",
    },
    {
        icon: BookOpenText,
        title: "ตรวจสอบผลการเรียน",
        desc: "สำหรับนักเรียนที่ต้องการตรวจสอบผลการเรียน สามารถเข้าไปดูรายละเอียดได้ที่นี่",
        href: "/register",
    },
    {
        icon: ScrollText,
        title: "ระบบนิเทศบุคลากร",
        desc: "ท่านสามารถเข้านิเทศบุคลากรและตรวจสอบผลการนิเทศบุคลากรได้ที่นี่",
        href: "/register",
    },
    {
        icon: BrainCircuit,
        title: "ระบบประเมินสมรรถนะนักเรียน",
        desc: "ท่านสามารถประเมินสมรรถนะนักเรียนและตรวจสอบผลการประเมินสมรรถนะนักเรียนได้ที่นี่",
        href: "/register",
    },
    {
        icon: BookCopy,
        title: "ระบบส่งเอกสารงานวิชาการ",
        desc: "ท่านสามารถส่งเอกสารงานวิชาการ ตรวจสอบผลการส่งเอกสารงานวิชาการและแก้ไขได้ที่นี่",
        href: "/register",
    },
    {
        icon: Layers,
        title: "รายการเอกสาร",
        desc: "รายการเอกสาร template สำหรับงานเอกสาร สามารถดูรายละเอียดได้ที่นี่",
        href: "/register",
    }
]

const admissionPlan = {
    gifted: [
        "ห้องพิเศษวิทยาศาสตร์ - คณิตศาสตร์ แผนการเรียนเตรียมแพทย์และสาธารณสุข (Gifted)",
        "ห้องพิเศษวิทยาศาสตร์ - คณิตศาสตร์ (Gifted)",
    ],
    sports: ["ห้องพิเศษกีฬา แผนการเรียนเตรียมวิทยาศาสตร์การกีฬา (ฟุตบอล, มวยปล้ำ)", "ห้องพิเศษกีฬา (ฟุตบอล, มวยปล้ำ)"],
    mep: ["ห้องพิเศษ MEP (Mini English Program)"],
    normal: ["ห้องเรียนปกติ"],
    highSchool: [
        "แผนการเรียน เตรียมวิศวะกรรมศาสตร์ (วิทย์-คณิต)",
        "แผนการเรียน เตรียมศึกษาศาสตร์และครุศาสตร์ (วิทย์-คณิต)",
        "แผนการเรียน เตรียมนิติศาสตร์-รัฐศาสตร์ (วิทย์-คณิต)",
        "แผนการเรียน เตรียมมนุษยศาสตร์-นิเทศศาสตร์-ศิลปกรรมศาสตร์ (ศิลป์-ภาษา)",
        "แผนการเรียน เตรียมเทคโนโลยีอุตศาหกรรมและการจัดการ",
    ],
}

export default {
    features,
    admissionPlan
}